MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4L1FYAUG/mcu.h
/**
 *******************************************************************************
 * @file    TMPM4L1.h
 * @brief   CMSIS Cortex-M4 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM4L1' Device Series
 * @version V1.0.2.0
 * $Date:: 2018-12-04 #$
 *
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LICENSE AGREEMENT.
 *
 * (C)Copyright TOSHIBA MICROELECTRONICS CORPORATION 2018 All rights reserved
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TXZ_MICROCONTROLLER
  * @{
  */

/** @addtogroup TMPM4L1
  * @{
  */

#ifndef __TMPM4L1_H__
#define __TMPM4L1_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M4 Processor Exceptions Numbers ***************************************************************/
  NonMaskableInt_IRQn           = -14,       /*!< 2 Non Maskable Interrupt                                    */
  HardFault_IRQn                = -13,       /*!< 3 Cortex-M4 Hard Fault Interrupt                            */
  MemoryManagement_IRQn         = -12,       /*!< 4 Cortex-M4 Memory Management Interrupt                     */
  BusFault_IRQn                 = -11,       /*!< 5 Cortex-M4 Bus Fault Interrupt                             */
  UsageFault_IRQn               = -10,       /*!< 6 Cortex-M4 Usage Fault Interrupt                           */
  SVCall_IRQn                   = -5,        /*!< 11 Cortex-M4 SV Call Interrupt                              */
  DebugMonitor_IRQn             = -4,        /*!< 12 Cortex-M4 Debug Monitor Interrupt                        */
  PendSV_IRQn                   = -2,        /*!< 14 Cortex-M4 Pend SV Interrupt                              */
  SysTick_IRQn                  = -1,        /*!< 15 Cortex-M4 System Tick Interrupt                          */

/******  TMPM4L1 Specific Interrupt Numbers *******************************************************************/
  INT00_IRQn                    = 0,         /*!< Interrupt pin 00                                            */
  INT01_IRQn                    = 1,         /*!< Interrupt pin 01                                            */
  INT02_IRQn                    = 2,         /*!< Interrupt pin 02                                            */
  INT03_IRQn                    = 3,         /*!< Interrupt pin 03                                            */
  INT04_IRQn                    = 4,         /*!< Interrupt pin 04                                            */
  INT05_IRQn                    = 5,         /*!< Interrupt pin 05                                            */
  INT06_IRQn                    = 6,         /*!< Interrupt pin 06                                            */
  INTT32A00_AT_CT_IRQn          = 8,         /*!< T32A00 Timer Interrupt A/Timer Interrupt C                  */
  INTT32A00_A01_C0_IRQn         = 9,         /*!< T32A00 Capture A0,A1,C0 Interrupt                           */
  INTT32A00_BT_C1_IRQn          = 10,        /*!< T32A00 Timer Interrupt B/Capture C1 Interrupt               */
  INTT32A00_B01_IRQn            = 11,        /*!< T32A00 Capture B0,B1 Interrupt                              */
  INTT32A01_AT_CT_IRQn          = 12,        /*!< T32A01 Timer Interrupt A/Timer Interrupt C                  */
  INTT32A01_A01_C0_IRQn         = 13,        /*!< T32A01 Capture A0,A1,C0 Interrupt                           */
  INTT32A01_BT_C1_IRQn          = 14,        /*!< T32A01 Timer Interrupt B/Capture C1 Interrupt               */
  INTT32A01_B01_IRQn            = 15,        /*!< T32A01 Capture B0,B1 Interrupt                              */
  INTT32A02_AT_CT_IRQn          = 16,        /*!< T32A02 Timer Interrupt A/Timer Interrupt C                  */
  INTT32A02_A01_C0_IRQn         = 17,        /*!< T32A02 Capture A0,A1,C0 Interrupt                           */
  INTT32A02_BT_C1_IRQn          = 18,        /*!< T32A02 Timer Interrupt B/Capture C1 Interrupt               */
  INTT32A02_B01_IRQn            = 19,        /*!< T32A02 Capture B0,B1 Interrupt                              */
  INTT32A03_AT_CT_IRQn          = 20,        /*!< T32A03 Timer Interrupt A/Timer Interrupt C                  */
  INTT32A03_A01_C0_IRQn         = 21,        /*!< T32A03 Capture A0,A1,C0 Interrupt                           */
  INTT32A03_BT_C1_IRQn          = 22,        /*!< T32A03 Timer Interrupt B/Capture C1 Interrupt               */
  INTT32A03_B01_IRQn            = 23,        /*!< T32A03 Capture B0,B1 Interrupt                              */
  INTVCN0_IRQn                  = 24,        /*!< A-VE ch0 interrupt                                          */
  INTVCT0_IRQn                  = 25,        /*!< A-VE ch0 task termination interrupt                         */
  INTEMG0_IRQn                  = 26,        /*!< PMD+ ch0 EMG interrupt                                      */
  INTOVV0_IRQn                  = 27,        /*!< PMD+ ch0 OVV interrupt                                      */
  INTPWM0_IRQn                  = 28,        /*!< PMD+ ch0 PWM interrupt                                      */
  INTENC00_IRQn                 = 29,        /*!< A-ENC32 ch0 Encoder interupt 0                              */
  INTENC01_IRQn                 = 30,        /*!< A-ENC32 ch0 Encoder interupt 1                              */
  INTADAPDA_IRQn                = 32,        /*!< ADC unit A PMD trigger program interrupt A                  */
  INTADAPDB_IRQn                = 33,        /*!< ADC unit A PMD trigger program interrupt B                  */
  INTADACP0_IRQn                = 34,        /*!< ADC conversion monitoring function interrupt 0              */
  INTADACP1_IRQn                = 35,        /*!< ADC conversion monitoring function interrupt 1              */
  INTADATRG_IRQn                = 36,        /*!< ADC conversion triggered by General purpose is finished     */
  INTADASGL_IRQn                = 37,        /*!< ADC conversion triggered by Single program is finished      */
  INTADACNT_IRQn                = 38,        /*!< ADC conversion triggered by Continuity program is finished  */
  INTT0RX_IRQn                  = 39,        /*!< TSPI/SIO reception (channel 0)                              */
  INTT0TX_IRQn                  = 40,        /*!< TSPI/SIO transmit (channel 0)                               */
  INTT0ERR_IRQn                 = 41,        /*!< TSPI/SIO error (channel 0)                                  */
  INTT1RX_IRQn                  = 42,        /*!< TSPI/SIO reception (channel 1)                              */
  INTT1TX_IRQn                  = 43,        /*!< TSPI/SIO transmit (channel 1)                               */
  INTT1ERR_IRQn                 = 44,        /*!< TSPI/SIO error (channel 1)                                  */
  INTT2RX_IRQn                  = 45,        /*!< TSPI/SIO reception (channel 2)                              */
  INTT2TX_IRQn                  = 46,        /*!< TSPI/SIO transmit (channel 2)                               */
  INTT2ERR_IRQn                 = 47,        /*!< TSPI/SIO error (channel 2)                                  */
  INTUART0RX_IRQn               = 48,        /*!< UART reception (channel 0)                                  */
  INTUART0TX_IRQn               = 49,        /*!< UART transmit (channel 0)                                   */
  INTUART0ERR_IRQn              = 50,        /*!< UART error (channel 0)                                      */
  INTUART1RX_IRQn               = 51,        /*!< UART reception (channel 1)                                  */
  INTUART1TX_IRQn               = 52,        /*!< UART transmit (channel 1)                                   */
  INTUART1ERR_IRQn              = 53,        /*!< UART error (channel 1)                                      */
  INTUART2RX_IRQn               = 54,        /*!< UART reception (channel 2)                                  */
  INTUART2TX_IRQn               = 55,        /*!< UART transmit (channel 2)                                   */
  INTUART2ERR_IRQn              = 56,        /*!< UART error (channel 2)                                      */
  INTPARI0_IRQn                 = 57,        /*!< RAM parity ch0 Parity error interrupt                       */
  INTFLCRDY_IRQn                = 58         /*!< Code FLASH Ready interrupt                                  */
} IRQn_Type;

